export const QUESTION_ARR = [
  {
    question: '游戏内观赛是否会计入防沉迷时长',
    answer: '观赛是不会计入防沉迷时长的，请尽情享受观赛乐趣吧。',
    imgUrl: '',
  },
  {
    question: '消耗荣耀币后没法领取任务奖励？',
    answer: '仅在游戏内「赛事专区」消耗指定数量荣耀币才可领取奖励。若您发现无法领取，请先检查在本平台消耗数额是否达标。若您已在「王者营地」内消耗了荣耀币，请于该渠道领取活动奖励。',
    imgUrl: '',
  },
  {
    question: '猜对比赛但竞猜币没到账？',
    answer: '题目开奖后所赢得的竞猜币，一般在10分钟内到账。若有派奖延时，还请耐心等候。',
    imgUrl: '',
  },
  {
    question: '进阶赛事战令有什么用？',
    answer: '进阶赛事战令后，您可领取【韩信街头霸王】星元部件、赛事战令荣耀播报、头像框等奖励，还可解锁预测专属进阶题目。购买高级进阶卡，更可直接提升30级赛事战令等级，获取专属观赛勋章。',
    imgUrl: '',
  },
  {
    question: '赛事战令奖励没有到账？',
    answer: '在赛事战令领取或兑换的奖励，将直接发放至「游戏背包」或「游戏邮件」，请于两处查验奖励（到账可能存在延迟）。',
    imgUrl: '',
  },
  {
    question: '荣耀币充值活动怎么没有了？',
    answer: '感谢召唤师的关注，充值送头像框活动已于2020年10月15日下线，敬请期待后续福利活动。',
    imgUrl: '',
  },
  {
    question: '弹幕抽奖中的实物奖品怎么收取？',
    answer: '中奖后，您可以直接填写收货地址，我们将在14个工作日内为您发货。',
    imgUrl: '',
  },
  {
    question: '怎么看比赛回放？',
    answer: '您可以在右侧赛程入口打开完整赛程，滑动即可看到往日比赛，并观看比赛回放。',
    imgUrl: './img/feed_img/faq8.png',
  },
  {
    question: '怎么开关/设置弹幕？',
    answer: '您可以点击直播画面唤起下方播控栏，并通过右下角的弹幕开关、设置按钮，自由调整弹幕的开关、大小、位置、透明度。',
    imgUrl: './img/feed_img/pt1.jpg',
  },
  {
    question: '怎么助威？',
    answer: '助威一般在KPL、冠军杯、K甲、模拟战等职业赛直播时开启，您可以通过直播「右下角礼物入口」或「聊天室上方对垒条」助威战队。使用荣耀币助威更可获得、升级各战队徽章，并有机会赢得获得周边奖品，不要错过噢。',
    imgUrl: './img/feed_img/faq4.png',
  },
  {
    question: '怎么关闭助威送礼效果？',
    answer: '您可以点击直播画面唤起播控栏，通过右下角的开关按钮，管理礼物特效的显示或隐藏。',
    imgUrl: './img/feed_img/faq3.png',
  },
  {
    question: '怎么看比赛积分榜？',
    answer: '您可以通过右侧赛程入口打开完整赛程，查看当前赛季的积分榜/对阵图。',
    imgUrl: './img/feed_img/faq9.png',
  },
  {
    question: '消耗荣耀币后没成为会员？',
    answer: '直播助威获得的赛事会员经验值，最晚会在1小时内生效。若因延迟对您造成不便，还请谅解。',
    imgUrl: '',
  },

  // {
  //     question: '充值活动的头像框等奖励未到账？',
  //     answer: '充值完成后需要回到原「活动页面」手动领取头像框、活动勋章、荣耀币，奖励一般在5分钟内发放到账。',
  //     imgUrl: ''
  // },
  // {
  //     question: '弹幕抽奖中了竞猜币但没到账？',
  //     answer: '弹幕抽奖所中的竞猜币，将在7个工作日内进行发放，请耐心等候。',
  //     imgUrl: ''
  // },
  // {
  //     question: '为什么不能给某些选手定向助威？',
  //     answer: '赛事助威升级中，全部选手助威功能将于后续版本上线，召唤师可先查看人气榜单或前往王者营地体验完整功能。（升级期间召唤师仍可正常送出各类道具并增加战队或选手人气值、个人成长值）',
  //     imgUrl: ''
  // }
];

export const FEED_BACK_LIST = [
  { text: '无法播放', value: 1 },
  { text: '花屏卡顿', value: 2 },
  { text: '弹幕问题', value: 3 },
  { text: '加载异常', value: 4 },
  { text: '崩溃出错', value: 5 },
  { text: '黑屏/卡顿', value: 12 },
  { text: '发言/弹幕', value: 13 },
  { text: '竞猜反馈', value: 14 },
  { text: '弹窗骚扰', value: 15 },
  { text: '吐槽建议', value: 16 },
  { text: '直播内容', value: 17 },
];
